<?php

namespace Database\Seeders;

use App\Models\PrizeBondSeries;
use Illuminate\Database\Seeder;

class PrizeBondSeriesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        foreach ([
                     'কক', 'কখ', 'কগ', 'কঘ', 'কঙ', 'কচ', 'কছ', 'কজ', 'কঝ', 'কঞ',
                     'কট', 'কঠ', 'কড', 'কঢ', 'কথ', 'কদ', 'কন', 'কপ', 'কফ', 'কব',
                     'কম', 'কল', 'কশ', 'কষ', 'কস', 'কহ',

                     'খক', 'খখ', 'খগ', 'খঘ', 'খঙ', 'খচ', 'খছ', 'খজ', 'খঝ', 'খঞ',
                     'খট', 'খঠ', 'খড', 'খঢ', 'খথ', 'খদ', 'খন', 'খপ', 'খফ', 'খব',
                     'খম', 'খল', 'খশ', 'খষ', 'খস', 'খহ',

                     'গক', 'গখ', 'গগ', 'গঘ', 'গঙ', 'গচ', 'গছ', 'গজ', 'গঝ', 'গঞ',
                     'গট', 'গঠ', 'গড', 'গঢ', 'গথ', 'গদ', 'গন', 'গপ', 'গফ', 'গব',
                     'গম', 'গল', 'গশ', 'গষ', 'গস', 'গহ',

                     'ঘক', 'ঘখ', 'ঘগ', 'ঘঘ', 'ঘঙ', 'ঘচ', 'ঘছ', 'ঘজ', 'ঘঝ', 'ঘঞ',
                     'ঘট', 'ঘঠ', 'ঘড', 'ঘঢ', 'ঘথ', 'ঘদ', 'ঘন', 'ঘপ', 'ঘফ', 'ঘব',
                     'ঘম', 'ঘল', 'ঘশ', 'ঘষ', 'ঘস', 'ঘহ',
                 ] as $series) {
            PrizeBondSeries::query()->firstOrCreate(
                ['name' => $series],
                ['is_active' => true]
            );
        }
    }
}
